REMOVE_ACCENT = {
        "à":"a","ằ":"ă","ằ":"â","è":"e","ề":"ê","ò":"o","ờ":"ơ","ồ":"ô","ì":"i","ỳ":"y",\
        "á":"a","ắ":"ă","ấ":"â","ó":"o","ớ":"ơ","ố":"ô","ú":"u","ứ":"ư","í":"i","ý":"y",\
        "ả":"a","ẳ":"ă","ẩ":"â","ỏ":"o","ở":"ơ","ổ":"ô","ủ":"u","ử":"ư","ỉ":"i","ỷ":"y",\
        "ã":"a","ẵ":"ă","ẫ":"â","õ":"o","ỡ":"ơ","ỗ":"ô","ũ":"u","ữ":"ư","ĩ":"i","ỹ":"y",\
        "ạ":"a","ặ":"ă","ậ":"â","ọ":"o","ợ":"ơ","ộ":"ô","ụ":"u","ự":"ư","ị":"i","ỵ":"y",\
        "â":"a","ă":"a","ơ":"o","ô":"ơ","ư":"u","ê":"e",\
        "a":"a","o":"o","i":"i","u":"u","e":"e","y":"y",
        }

REMOVE_SIGN={"â":"a","ă":"a","ư":"u","ơ":"o","ô":"o","ê":"e"}
ADD_GRAVE = {"a":"à","ă":"ằ","â":"ầ","e":"è","ê":"ề","o":"ò","ơ":"ờ","ô":"ồ","u":"ù","ư":"ừ","i":"ì","y":"ỳ"}
ADD_ACUTE = {"a":"á","ă":"ắ","â":"ấ","e":"é","ê":"ế","o":"ó","ơ":"ớ","ô":"ố","u":"ú","ư":"ứ","i":"í","y":"ý"}
ADD_HOOK = {"a":"ả","ă":"ẳ","â":"ẩ","e":"ẻ","ê":"ể","o":"ỏ","ơ":"ở","ô":"ổ","u":"ủ","ư":"ử","i":"ỉ","y":"ỷ"}
ADD_TILDE = {"a":"ã","ă":"ẵ","â":"ẫ","e":"ẽ","ê":"ễ","o":"õ","ơ":"ỡ","ô":"ỗ","u":"ũ","ư":"ữ","i":"ĩ","y":"ỹ"}
ADD_DOT = {"a":"ạ","ă":"ặ","â":"ậ","e":"ẹ","ê":"ệ","o":"ọ","ơ":"ợ","ô":"ộ","u":"ụ","ư":"ự","i":"ị","y":"ỵ"}

ADD_UMSIGN={"a":"â","o":"ô","e":"ê"}
ADD_VSIGN={"a":"ă","o":"ơ","u":"ư"}

PIORITY_ACCENT = {"a":5,"ă":5,"â":5,"e":4,"ê":4,"o":3,"ô":3,"ơ":3,"i":2,"y":1,"u":0,"ư":0}
